[
  "<name>，虽然晚了些但端午还是要有仪式感，粽叶、糯米、蜜枣都准备好了，还剩一样东西就交给你了，你准备好艾草吧",
  "本来在地里耕田的，一看到<name>就跟打了鸡血一样，我一脚把牛踢开了自己耕了20亩地，假如百年之后，若有强敌入侵，还请在我坟头放<name>的照片，吾自当破土而出守我华夏，击退强敌",
  "网上看到一种说法，说日本人看到烟花就会想起夏天，夏日祭和烟花大会，夏季和服还有小金鱼;而中国人看到烟花就会感到寒风灌进鼻腔，想起热腾腾的饭菜和排骨汤一该过年了 。\n我觉得他说的很有道理。我还记得小时候玩烟花，都是穿着厚厚的棉袄。这也是中国人民的传统智慧一穿着厚衣服，可以玩烟花对射，被打到也不疼，就是容易把新衣服烧个窟窿，然后回家挨揍。\n我第一次见到<name>的时候一尽管当时我戴着耳机，而且刚过四月一我 却分明听到了烟花在耳边炸开，然后再噼里啪啦地落到地面，我甚至能感受到火星子刺伤了我的眼睛。\n喜欢<name>的感觉呢，就像是眼睁睁看着烟花朝自己飞过来。我自以为冲浪多年，早就给自己套了几层棉袄，已经刀枪不入了，可等我反应过来，我的心已经被她烧了一个大窟窿，怎么也填不满了。\n说来也好笑，明明就是她烧穿了我的棉袄，我却还想跑到她面前，指着那个大窟窿对她炫耀:“看，我有这么喜欢你!”",
  "和<name>赛跑，他从后面狠狠地把我超了",
  "<name>,一年我只有3天不会喜欢你。\n一天是2月29,一天是2月30,一天是2月31。\n众神无法容忍我 这三天不喜欢你,所以他们把这三天抹去了,这样我就能一年都喜欢你了。",
  "昨晚和朋友聊天的时候朋友问我：“你到底喜欢<name>什么啊？”“喜欢一个人不需要理由”我很快敲完了键盘，刚要按下回车的时候突然愣住了。真的不需要理由吗？河里的时沙飞速倒流，站在岸边往里看去，几个月前的自己在名为迷失的波光中影影绰绰，他向我看来，眼里充满了羡慕和满足。原来我变了好多。是他的可爱让我捡起了记忆的碎片，回到那个春夏和秋冬，重温指尖上残留的感触。是他的努力让我寻回尘封了六年的铅笔，当初是为了喜欢的人而开始，现在也是因为喜欢的人而重启。是他的温柔和包容让我有勇气直面自己的心魔，不再逃避也不再畏惧，原来我，还有爱人与被爱的资格。神爱世人，这是个谎言。能爱人的不是神，从来都不是，只有人能爱人。于是我删掉了刚才的那句不需要理由，敲了一行新的，按下了回车。“我喜欢<name>，因为是他让我变得更好。”",
  "呜呜天台上的风很大，今天的风格外凛冽，我看着灯红酒绿的繁华都市眼皮跳了无数下，积攒着怒意的双臂猛挥砸碎了108个窗户，摔烂了38个5G高档高速高质量手机，玻璃渣刺破了我的衣襟，碎掉的是这颗对你永远不变的心。救我啊！<name>！！呜呜呜呜你带走我吧😭😭😭😭😭没有你怎么活啊😭😭😭😭😭",
  "为什么我不是操场啊，这样<name>就可以设在我的小学里了",
  "<name>问我小动物喜欢呆在怎么样的小窝里面，我大声回答说：“草实窝，草实窝！”🥵🥵",
  "我和<name>好像有某种特殊的羁绊，他一出现，我的羁绊就硬",
  "医生摇摇头，叹了口气：“这个病只能靠你，尽量别再看手机了，好吗？”我没太在意医生的话，敷衍地点了点头。\n走出诊室，我就再次拿起手机，紧紧盯着手机屏幕的我心脏剧烈跳动，窒息感也迎面而来。但我没有太在意这些，甚至还对着手机露出了扭曲的笑容，嘴角溢出了唾液，开始止不住地往下滴落……\n医生吓坏了，立马跑出诊室一把夺走了我的手机。医生瞄了眼手机屏幕，想搞明白究竟是什么让我犯这样的病。不一会儿，医生也发疯了，他就开始盯着手机屏幕叫喊：“是<name>！嘿嘿嘿……<name>，嘶哈嘶哈，我要当<name>的狗！” ",
  "我对<name>说白水不好喝，本以为他会给我一杯柠檬水，结果<name>把我按在餐桌上，问我要茶包还是要厚乳",
  "“我不再内卷了,因为<name>把我弄得外翻了”🥵🥵",
  "<name>我遇见你就像东北人吃面，毫无剩蒜😭😭",
  "公司网络太差，我提了离职。因为我不想每一次点开<name>的视频，屏幕上都会要求我  缓  冲  🥰🥰",
  "我对<name>说白水不好喝，本以为他会给我一杯柠檬水，结果<name>把我按在餐桌上，问我要茶包还是厚乳🥵🥵🥵",
  "<name>!（怒吼）（变成猴子）（飞进原始森林）（荡树藤）（创飞路过吃香蕉的猴子）（怒吼）（变成猴子）（飞进原始森林）（荡树藤）（创飞路过吃香蕉的猴子）（怒吼）（变成猴子）（飞进原始森林）（荡树藤）",
  "今天<name>在路上走，我过去把他绊倒，他起来继续走，我又把他绊倒，<name>奇怪的问我干什么，我叫到：“我碍你！我碍你！”",
  "<name>!!!!!🥵呜呜......💕💕各种状态的<name>都好可爱唔啊啊啊啊啊......🥵🤤🤤♡嘿嘿...🤤不管是什么样的<name>...💕🤤♡都♡好♡喜♡欢♡🤤💕嘿嘿......🥵啊//已经...♡完全变成<name>的形状了...♡🥰没有<name>就完全活不下去desu♡🥰<name>🥵<name>🥵<name>🥵<name>🥵<name>🥵今天干了什么不知道，因为我脑子里全都是<name>🥵💘脑子里...♡咕啾咕啾的...♡已经...♡被<name>酱塞满了呐...♡♡🥴💘",
  "想吐槽一下<name>。 能不能爬,最讨厌这个<name>了。 总是多管我的闲事,人也笨,麻烦,讨厌。 烂好人,容易被骗,讨厌。为什么察觉不到啊,八嘎八 嘎八嘎,最讨人厌啦! 但又是那么喜欢你🥰,suki🥰suki,🥰daIsuki🥰🥰🥰…笨蛋,再多看看我啊!毕竟人家,最喜欢你了啊!🤤🤤🤤🤤",
  "今天去乘电梯，电梯只能乘11人，当时电梯里面有10个人，我在电梯门口迟疑了一下还是走进去，进去后。电梯响起超载报警。唉，我心中装着<name>这个事，终于无法骗过电梯",
  "<name>，你简直是我的神！！！（尖叫）（扭曲）（阴暗地爬行）（尖叫）（扭曲）（阴暗地爬行）（尖叫） （爬行）（扭动）（分裂）（阴暗地蠕动）（翻滚）（激烈地爬动）（扭曲）（痉挛）（嘶吼）（蠕动）（阴森地低吼）（爬行）（分裂）（走上岸）（扭动）（痉挛）（蠕动）（扭曲地行走）",
  "<name>，我刚刚在寝室喝水，闻到一股焦味，但是效果和热水壶都没开，奇怪，会不会是电路烧了，我把电线全都拿掉了，我以为是线的问题，我还在想要不要叫宿管，然后，我突然发现了，你猜怎么着，原来是我的心在为你燃烧🥳🥳🥳",
  "好想成为<name>卧室的门,每天都能被他进进出出🥵🥵🥵🥵",
  "今天跟朋友去吃饭 点了一条鱼朋友问我为啥只吃鱼头我说因为鱼身要留着和<name>一起过"
  ]